import time
from unittest import case


def get_schedule_first_week(group, day_of_week):
    match group:
        case 1:
            match day_of_week:
                case 0 : return Monday_1()
                case 1 : return Tuesday_1()
                case 2 : return Wednesday_1()
                case 3 : return Thursday_1()
                case 4 : return Friday_1()
                case 5 : return Saturday_1()
                case 6 : return Sunday_1()
                case _ : return Sunday_1()
        case 2:
            match day_of_week:
                case 0 : return Monday_2()
                case 1 : return Tuesday_2()
                case 2 : return Wednesday_2()
                case 3 : return Thursday_2()
                case 4 : return Friday_2()
                case 5 : return Saturday_2()
                case 6 : return Sunday_1()
                case _ : return Sunday_1()

def Monday_1():
    Schedule = """
1.(8:00 - 9:30)
2. ИСТОРИЯ РОССИИ (Практика) (9:40-11:10)
    БЫКОВА В.В., АУД. 432	
3. ДИСКРЕТНАЯ МАТЕМАТИКА (Практика)	(11:20 - 12:50)
    ЗЕМЦОВА Е.М., АУД. 132	
4. ДИСКРЕТНАЯ МАТЕМАТИКА (Практика)	(13:15 - 14:45)
    ЗЕМЦОВА Е.М., ДОЦЕНТ, АУД. 132	
5. ЛИНЕЙНАЯ АЛГЕБРА И АНАЛИТИЧЕСКАЯ ГЕОМЕТРИЯ (Практика)	(15:00 - 16:30)
    МИТИНА О.В., АУД. 351А / 132	
6. (16:40 - 18:10)
    """
    return Schedule


def Tuesday_1():
    Schedule = """
1. ОСНОВЫ РОССИЙСКОЙ ГОСУДАРСТВЕННОСТИ (Практика) (8:00 - 9:30)
    КОРЕЦКАЯ Т.П., АУД. 429	
2. ФИЗИКА (Практика) (9:40-11:10)
    БУТЬКО Л.Н., ДОЦЕНТ, АУД. 132		
3. ОСНОВЫ РОССИЙСКОЙ ГОСУДАРСТВЕННОСТИ (Лекция) (11:20 - 12:50)
    КОРЕЦКАЯ Т.П., АУД. А-13		
4. СОВР.ТЕХНОЛОГИИ ПОИСКА И ОБРАБОТКИ ИНФОРМАЦИИ (Лекция) (13:15 - 14:45)
    ЗЕМЦОВА Е.М., А-17 (1-8 НЕД.)	
5. (15:00 - 16:30)	
6. (16:40 - 18:10)
    """
    return Schedule

def Wednesday_1():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. СОВР.ТЕХНОЛОГИИ ПОИСКА И ОБРАБОТКИ ИНФОРМАЦИИ (Практика)	(11:20 - 12:50)
    ЗЕМЦОВА Е.М.,АУД. 132 (1-8 НЕД.)	
4. ДИСКРЕТНАЯ МАТЕМАТИКА (Лекция) (13:15 - 14:45)
    ЗЕМЦОВА Е.М., АУД. А-15	
5. (15:00 - 16:30)	
6. (16:40 - 18:10)
    """
    return Schedule

def Thursday_1():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. ЛИНЕЙНАЯ АЛГЕБРА И АНАЛИТИЧЕСКАЯ ГЕОМЕТРИЯ (Лекция) (11:20 - 12:50)
    МИТИНА О.В., АУД. А-15	
4. МАТЕМАТИЧЕСКИЙ АНАЛИЗ. ДИФФЕРЕНЦИАЛЬНЫЕ И  РАЗНОСТНЫЕ УРАВНЕНИЯ (Лекция) (13:15 - 14:45)
    ШАЙХУЛЛИНА П.А., АУД. А-15	
5. МАТЕМАТИЧЕСКИЙ АНАЛИЗ. ДИФФЕРЕНЦИАЛЬНЫЕ И  РАЗНОСТНЫЕ УРАВНЕНИЯ (Практика) (15:00 - 16:30)
    ШАЙХУЛЛИНА П.А., АУД. 431	
6. (16:40 - 18:10)
    """
    return Schedule

def Friday_1():
    Schedule = """
1. (8:00 - 9:30)
2. ФИЗИЧЕСКАЯ КУЛЬТУРА И СПОРТ (Практика) (9:40-11:10)
    ПАНЬКИН В.Е., АУД. 100 (4 корпус)	
3. ИНОСТРАННЫЙ ЯЗЫК (Практика) 1 группа (11:20 - 12:50) 
    СОТНИКОВА Е.С., АУД. 337
4. (13:15 - 14:45)
5. (15:00 - 16:30)
6. (16:40 - 18:10)
    """
    return Schedule
def Saturday_1():
    Schedule = """
1. (8:00 - 9:30)
2. ИНФОРМАТИКА (Лекция) (9:40-11:10)
    ТЕРЮХИН А.Е., АУД. А-15
3. ПРОГРАММИРОВАНИЕ (Лекция) (11:20 - 12:50)
    БАБИН И.К., АУД. А-13	
4. ИНФОРМАТИКА (ПР.) (13:15 - 14:45)
    ТЕРЮХИН А.Е., АУД. 132А	
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
    return Schedule


def Sunday_1():
    None

# second group
def Monday_2():
    Schedule = """
1.(8:00 - 9:30)
2. ИСТОРИЯ РОССИИ (Практика) (9:40-11:10)
    БЫКОВА В.В., АУД. 432	
3. ДИСКРЕТНАЯ МАТЕМАТИКА (Практика)	(11:20 - 12:50)
    ЗЕМЦОВА Е.М., АУД. 132	
4. ДИСКРЕТНАЯ МАТЕМАТИКА (Практика)	(13:15 - 14:45)
    ЗЕМЦОВА Е.М., ДОЦЕНТ, АУД. 132	
5. ЛИНЕЙНАЯ АЛГЕБРА И АНАЛИТИЧЕСКАЯ ГЕОМЕТРИЯ (Практика)	(15:00 - 16:30)
    МИТИНА О.В., АУД. 351А / 132	
6. (16:40 - 18:10)
    """



def Tuesday_2():
    Schedule = """
1. ОСНОВЫ РОССИЙСКОЙ ГОСУДАРСТВЕННОСТИ (Практика) (8:00 - 9:30)
    КОРЕЦКАЯ Т.П., АУД. 429	
2. ФИЗИКА (Практика) (9:40-11:10)
    БУТЬКО Л.Н., ДОЦЕНТ, АУД. 132		
3. ОСНОВЫ РОССИЙСКОЙ ГОСУДАРСТВЕННОСТИ (Лекция) (11:20 - 12:50)
    КОРЕЦКАЯ Т.П., АУД. А-13		
4. СОВР.ТЕХНОЛОГИИ ПОИСКА И ОБРАБОТКИ ИНФОРМАЦИИ (Лекция) (13:15 - 14:45)
    ЗЕМЦОВА Е.М., А-17 (1-8 НЕД.)	
5. (15:00 - 16:30)	
6. (16:40 - 18:10)
    """


def Wednesday_2():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. СОВР.ТЕХНОЛОГИИ ПОИСКА И ОБРАБОТКИ ИНФОРМАЦИИ (Практика)	(11:20 - 12:50)
    ЗЕМЦОВА Е.М.,АУД. 132 (1-8 НЕД.)	
4. ДИСКРЕТНАЯ МАТЕМАТИКА (Лекция) (13:15 - 14:45)
    ЗЕМЦОВА Е.М., АУД. А-15	
5. (15:00 - 16:30)	
6. (16:40 - 18:10)
    """


def Thursday_2():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. ЛИНЕЙНАЯ АЛГЕБРА И АНАЛИТИЧЕСКАЯ ГЕОМЕТРИЯ (Лекция) (11:20 - 12:50)
    МИТИНА О.В., АУД. А-15	
4. МАТЕМАТИЧЕСКИЙ АНАЛИЗ. ДИФФЕРЕНЦИАЛЬНЫЕ И  РАЗНОСТНЫЕ УРАВНЕНИЯ (Лекция) (13:15 - 14:45)
    ШАЙХУЛЛИНА П.А., АУД. А-15	
5. МАТЕМАТИЧЕСКИЙ АНАЛИЗ. ДИФФЕРЕНЦИАЛЬНЫЕ И  РАЗНОСТНЫЕ УРАВНЕНИЯ (Практика) (15:00 - 16:30)
    ШАЙХУЛЛИНА П.А., АУД. 431	
6. (16:40 - 18:10)
    """


def Friday_2():
    Schedule = """
1. (8:00 - 9:30)
2. ФИЗИЧЕСКАЯ КУЛЬТУРА И СПОРТ (Практика) (9:40-11:10)
    ПАНЬКИН В.Е., АУД. 100 (4 корпус)	
3. ИНОСТРАННЫЙ ЯЗЫК (Практика) 2 группа (11:20 - 12:50) 
    МИНГАЖЕВА Е.А., АУД. 132Б
4. (13:15 - 14:45)
5. (15:00 - 16:30)
6. (16:40 - 18:10)
    """

def Saturday_2():
    Schedule = """
1. (8:00 - 9:30)
2. ИНФОРМАТИКА (Лекция) (9:40-11:10)
    ТЕРЮХИН А.Е., АУД. А-15
3. ПРОГРАММИРОВАНИЕ (Лекция) (11:20 - 12:50)
    БАБИН И.К., АУД. А-13	
4. ИНФОРМАТИКА (ПР.) (13:15 - 14:45)
    ТЕРЮХИН А.Е., АУД. 132А	
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
#================================================================================================
