def get_schedule_second_week(group, day_of_week):
    match group:
        case 1:
            match day_of_week:
                case 0 : return Monday_1()
                case 1 : return Tuesday_1()
                case 2 : return Wednesday_1()
                case 3 : return Thursday_1()
                case 4 : return Friday_1()
                case 5 : return Saturday_1()
                case 6 : return Sunday_1()
                case _ : return Sunday_1()
        case 2:
            match day_of_week:
                case 0 : return Monday_2()
                case 1 : return Tuesday_2()
                case 2 : return Wednesday_2()
                case 3 : return Thursday_2()
                case 4 : return Friday_2()
                case 5 : return Saturday_2()
                case 6 : return Sunday_1()
                case _ : return Sunday_1()


def Monday_1():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. (11:20 - 12:50)
4. ДИСКРЕТНАЯ МАТЕМАТИКА (Практика) (13:15 - 14:45)
    ЗЕМЦОВА Е.М., АУД. 132	
5. ЛИНЕЙНАЯ АЛГЕБРА И АНАЛИТИЧЕСКАЯ ГЕОМЕТРИЯ (Практика) (15:00 - 16:30)
    МИТИНА О.В., АУД. 351А / 132	
6. (16:40 - 18:10)
"""
    return Schedule


def Tuesday_1():
    Schedule = """
1. ОСНОВЫ РОССИЙСКОЙ ГОСУДАРСТВЕННОСТИ (Практика) (8:00 - 9:30)
    КОРЕЦКАЯ Т.П., АУД. 429	
2. ФИЗИКА (Лекция)(9:40-11:10)
    БУТЬКО Л.Н., ДОЦЕНТ, АУД. А-13
3. ПРАВО (Лекция) (11:20 - 12:50)
    КОРЕЦКАЯ Т.П., АУД. А-13	
4. (13:15 - 14:45)
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
    return Schedule

def Wednesday_1():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. (11:20 - 12:50)
4. ИСТОРИЯ РОССИИ (Лекция) (13:15 - 14:45)
    РЫБАЛКО А.А., АУД. А-15	
5. ИНОСТРАННЫЙ ЯЗЫК (Практика) (15:00 - 16:30)
    СОТНИКОВА Е.С., АУД. 132Б
6. ИНОСТРАННЫЙ ЯЗЫК (Практика) (16:40 - 18:10)
    СОТНИКОВА Е.С., АУД. 132Б
"""
    return Schedule

def Thursday_1():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. ЛИНЕЙНАЯ АЛГЕБРА И АНАЛИТИЧЕСКАЯ ГЕОМЕТРИЯ (Лекция) (11:20 - 12:50)
    МИТИНА О.В., АУД. А-15	
4. МАТЕМАТИЧЕСКИЙ АНАЛИЗ. ДИФФЕРЕНЦИАЛЬНЫЕ И  РАЗНОСТНЫЕ УРАВНЕНИЯ (Лекция) (13:15 - 14:45)
    ШАЙХУЛЛИНА П.А., АУД. А-15	
5. МАТЕМАТИЧЕСКИЙ АНАЛИЗ. ДИФФЕРЕНЦИАЛЬНЫЕ И  РАЗНОСТНЫЕ УРАВНЕНИЯ (Практика) (15:00 - 16:30)
    ШАЙХУЛЛИНА П.А., АУД. 431	
6. (16:40 - 18:10)
    """
    return Schedule

def Friday_1():
    Schedule = """
1. (8:00 - 9:30)
2.  ФИЗИЧЕСКАЯ КУЛЬТУРА И СПОРТ (Практика) (9:40-11:10)
    ПАНЬКИН В.Е., АУД. 100 (4 корпус)
3. ФИЗИКА (Практика) (11:20 - 12:50)
    БУТЬКО Л.Н., АУД. 132
4. (13:15 - 14:45)
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
    return Schedule
def Saturday_1():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. ПРОГРАММИРОВАНИЕ (Практика) (11:20 - 12:50)
    БАБИН И.К., АУД. 132А
4. ПРОГРАММИРОВАНИЕ (Практика) (13:15 - 14:45)
    БАБИН И.К., АУД. 132А
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
    return Schedule

def Sunday_1():
    Schedule = """
    None
    """
    return Schedule




def Monday_2():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. (11:20 - 12:50)
4. ДИСКРЕТНАЯ МАТЕМАТИКА (Практика) (13:15 - 14:45)
    ЗЕМЦОВА Е.М., АУД. 132	
5. ЛИНЕЙНАЯ АЛГЕБРА И АНАЛИТИЧЕСКАЯ ГЕОМЕТРИЯ (Практика) (15:00 - 16:30)
    МИТИНА О.В., АУД. 351А / 132	
6. (16:40 - 18:10)
"""
    return Schedule


def Tuesday_2():
    Schedule = """
1. ОСНОВЫ РОССИЙСКОЙ ГОСУДАРСТВЕННОСТИ (Практика) (8:00 - 9:30)
    КОРЕЦКАЯ Т.П., АУД. 429	
2. ФИЗИКА (Лекция)(9:40-11:10)
    БУТЬКО Л.Н., ДОЦЕНТ, АУД. А-13
3. ПРАВО (Лекция) (11:20 - 12:50)
    КОРЕЦКАЯ Т.П., АУД. А-13	
4. (13:15 - 14:45)
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
    return Schedule

def Wednesday_2():
    Schedule = """
1. (8:00 - 9:30)
2. ИНОСТРАННЫЙ ЯЗЫК (ПР.) (9:40-11:10)
    МИНГАЖЕВА Е.А., АУД. 132Б
3. ИНОСТРАННЫЙ ЯЗЫК (ПР.) (11:20 - 12:50)
    МИНГАЖЕВА Е.А., АУД. 132Б
4. ИСТОРИЯ РОССИИ (Лекция) (13:15 - 14:45)
    РЫБАЛКО А.А., АУД. А-15	
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
    return Schedule

def Thursday_2():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. ЛИНЕЙНАЯ АЛГЕБРА И АНАЛИТИЧЕСКАЯ ГЕОМЕТРИЯ (Лекция) (11:20 - 12:50)
    МИТИНА О.В., АУД. А-15	
4. МАТЕМАТИЧЕСКИЙ АНАЛИЗ. ДИФФЕРЕНЦИАЛЬНЫЕ И  РАЗНОСТНЫЕ УРАВНЕНИЯ (Лекция) (13:15 - 14:45)
    ШАЙХУЛЛИНА П.А., АУД. А-15	
5. МАТЕМАТИЧЕСКИЙ АНАЛИЗ. ДИФФЕРЕНЦИАЛЬНЫЕ И  РАЗНОСТНЫЕ УРАВНЕНИЯ (Практика) (15:00 - 16:30)
    ШАЙХУЛЛИНА П.А., АУД. 431	
6. (16:40 - 18:10)
    """
    return Schedule

def Friday_2():
    Schedule = """
1. (8:00 - 9:30)
2.  ФИЗИЧЕСКАЯ КУЛЬТУРА И СПОРТ (Практика) (9:40-11:10)
    ПАНЬКИН В.Е., АУД. 100 (4 корпус)
3. ФИЗИКА (Практика) (11:20 - 12:50)
    БУТЬКО Л.Н., АУД. 132
4. (13:15 - 14:45)
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
    return Schedule
def Saturday_2():
    Schedule = """
1. (8:00 - 9:30)
2. (9:40-11:10)
3. ПРОГРАММИРОВАНИЕ (Практика) (11:20 - 12:50)
    БАБИН И.К., АУД. 132А
4. ПРОГРАММИРОВАНИЕ (Практика) (13:15 - 14:45)
    БАБИН И.К., АУД. 132А
5. (15:00 - 16:30)
6. (16:40 - 18:10)
"""
    return Schedule

def Sunday_2():
    None